Revit 2026 API

# ISelectionFilter Interface

---

An interface that provides the ability to filter objects during a selection operation.

**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface ISelectionFilter
```
```vb
Public Interface ISelectionFilter
```
```cpp
public interface class ISelectionFilter
```
```fsharp
type ISelectionFilter = interface end
```

The ISelectionFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllowElement | Override this pre-filter method to specify if the element should be permitted to be selected. |
|  | AllowReference | Override this post-filter method to specify if a reference to a piece of geometry is permitted to be selected. |

#### Reference

Autodesk.Revit.UI.Selection Namespace